posts/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs my Beloved</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="icon" type="image/x-icon" href="/static/profile.png">

<link rel="preconnect" href="https://rsms.me/">
<link rel="stylesheet" href="https://rsms.me/inter/inter.css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link
    href="https://fonts.googleapis.com/css2?family=IBM+Plex+Mono:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;1,100;1,200;1,300;1,400;1,500;1,600;1,700&display=swap"
    rel="stylesheet">

</head>
<body>
<div id="preamble" class="status">
<header>
    <h1>
        <a id="bigtitle" href="/">Gabriel</a>
    </h1>
    <nav>
        <ul id="navlist">
            <li id="navlistitem"><a href="/projects.html">Projects</a></li>
            <li id="navlistitem"><a href="/posts/">Posts</a></li>
            <li id="navlistitem"><a href="/literature/">Literature</a></li>
        </ul>
    </nav>
</header>
<div id="date">
    06 June, 2026 <i>Anno Domini</i> - 13:42
</div>
</div>
<div id="content" class="content">
<h1 class="title">Emacs my Beloved</h1>
<p>
I wrote my last post about text editors in March 2025, so I guess it's time for yet another one.
</p>

<p>
I'm using Emacs again, and this probably needs a lot of explanation. First and foremost, it's important to make it clear I'm not using it because it's <i>productive</i>, but because it's <i>confortable</i>. If I were to code in Visual Studio Code I would be outpputing more code with roughly the same quality as I'm doing in Emacs, but I'm not using Emacs just for coding.
</p>

<p>
And that's the main point here. Emacs is not just a text editor. It's more like a shell, or a virtual machine userland. To use Emacs is very much like to use Plan 9 From User Space, where you swap most of your host operating system userland with it's functionality and compatible tools. With Emacs, you stop using a terminal and a file manager to use Emacs functionality.
</p>

<p>
And as with lots of things in computing, it's more important to have a standard at all than to seek the perfect standard. Emacs standardizes the interface for a lot of functionality in your system, and thus it's more confortable to use it than to context-switch between various things. If I'm coding and suddenly needs to mess with some files in another directory, it's very convenient to do that in Emacs, and Dired works great as a general-purpose file manager (imagine using Visual Studio Code's tree as a general-purpose file manager). This standardization of the interface gets even better due to the sheer amount of nice software written for it (for instance, Magit and Org mode).
</p>

<p>
Emacs is great, but there're problems I identify and would like to solve. It's old and tired, and in need of a spiritual successor. I very much like the "virtual-machine" architecture, and for this I'm doing some experiments using Elixir, as I think the BEAM virtual machine would be perfect for this use case. But, I may also only implement the things I need &#x2013; coding tools including Git, file manager, Org mode, Email reader and music player &#x2013; and go on with a simpler approach.
</p>
</div>
<div id="postamble" class="status">
<footer>
    <hr width="80%">
    © Gabriel G. de Brito (CC-BY-NC). Code for this page is free and open
    source, licensed under the MIT license. Help improving it on
    <a href="https://github.com/gboncoffee/gboncoffee.github.io">GitHub</a>.
</footer>
</div>
</body>
</html>
